[
  {
    "name": "Grab",
    "title": "Senior Web Engineer",
    "location": "Jakarta, ID",
    "url": "https://www.grab.com",
    "desc": "Grab is a Singaporean decacorn transportation company. Currently, Grab has numerous products as a superapp and I am helping the development of the Reporting team on Merchant Experience.<br/><br/> Technology used:  ReactJS, Redux, Jest",
    "time": "Mar 2021 - Present"
  },
  {
    "name": "Global Tiket Network (Tiket.com)",
    "title": "Senior Frontend Engineer",
    "location": "Jakarta, ID",
    "url": "https://www.tiket.com",
    "desc": "Tiket.com is an online travel agent founded in 2011 which provides services to order flight ticket, hotel room, events/concerts ticket, attractions ticket, train ticket and also car rental.<br/><br/>Working in tiket.com is one of my great working experience because I have learned to build a good looking and functional website for our customers.<br/><br/> I also learned to working and growing together as a team. At first, our team only consisted of 3 persons, and now our team consists of 9 persons.<br/><br/> Technology used: ReactJS, Redux, GraphQL, Jest",
    "time": "Jul 2019 - Mar 2021"
  },
  {
    "name": "Global Tiket Network (Tiket.com)",
    "title": "Frontend Engineer",
    "location": "Jakarta, ID",
    "url": "https://www.tiket.com",
    "desc": "Tiket.com is an online travel agent founded in 2011 which provides services to order flight ticket, hotel room, events/concerts ticket, attractions ticket, train ticket and also car rental.<br/><br/>Working in tiket.com isone of my great working experience because I have learned to build a good looking and functionalwebsite for our customers.<br/><br/>Technology used: ReactJS, Redux",
    "time": "Oct 2017 - Jul 2018"
  },
  {
    "name": "Globalnet Aplikasi Indotravel (Indonesia Flight)",
    "title": "Backend Engineer",
    "location": "Jakarta, ID",
    "url": "https://www.indonesiaflight.id",
    "desc": "GAI is a startup company which has acquired by Global Tiket Network on late 2018. We had two products, Tiket Kereta Api (mobile app) and Indonesia Flight (web & mobile app). Tiket Kereta Api is an app to order train ticket and Indonesia Flight is an app to order flight ticket and hotel room.<br/><br/> As a backend engineer, I collaborate with frontend engineer and also business team. We strive to deliver fastest and most efficient results. Due to small number of team, I also have to work agile and dynamics towards any changes.<br/><br/>Technology used: Node.js, MySQL, Redis",
    "time": "Mar 2017 - Oct 2017"
  },
  {
    "name": "Bina Nusantara Group",
    "title": "Junior Programmer",
    "location": "Jakarta, ID",
    "url": "https://www.binus.ac.id",
    "desc": "Bina Nusantara Group is a group company of my university. I got an opportunity to learn and work while studying as a scholar. I worked in General Affair, Marketing & Binus Center team which handles numerous web app that used by GA & Legal Department, Marketing Department and Binus Center (https: //binuscenter.com).<br/><br/>As a junior programmer, I developed and maintained web apps according to my Project Manager or System Analyst requirements.<br/><br/>Tehcnology used: ASP.NET, ASP.NET MVC, Microsoft SQL, JQuery",
    "time": "Mar 2014 - Mar 2017"
  }
]